Управление_торговлей_115_демо_.Teklifo/src/Documents/TK_ЗапросЦенПоставщикам/TK_ЗапросЦенПоставщикам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>TK_ЗапросЦенПоставщикам</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Заголовок</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапроса</name>
    <type>
      <types>EnumRef.TK_ТипыЗапросовЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>НачальнаяДатаСбораПредложений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонечнаяДатаСбораПредложений</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстовоеОписание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКУсловиямДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийКУсловиямОплаты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяЦена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей_115_демо_.Teklifo/src/Enums/TK_СтатусыПубликацииЗапросовЦен/TK_СтатусыПубликацииЗапросовЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>TK_СтатусыПубликацииЗапросовЦен</name>
  <enumValues>
    <name>Опубликован</name>
  </enumValues>
  <enumValues>
    <name>НеОпубликован</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяОбновление</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей_115_демо_.Teklifo/src/Documents/TK_ЗапросЦенПоставщикам/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    // СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

	УстановитьОтборПоДоступнымОрганизациям();

	ОтобразитьВнешнююСсылкуНаОпубликованныйДокумент();

	ОтобразитьТекущийСтатусПубликацииДокумета();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 	

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)

	Если ИмяСобытия = "TK_ОбновлениеСтатусаПубликации" И Параметр = Объект.Ссылка Тогда
		ОтобразитьВнешнююСсылкуНаОпубликованныйДокумент();
		ОтобразитьТекущийСтатусПубликацииДокумета();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	ОтобразитьТекущийСтатусПубликацииДокумета();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаНаДокументНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;

	Если ЗначениеЗаполнено(ВнешняяСсылка) Тогда
		TK_ОбщегоНазначенияКлиент.ОткрытьСсылкуНаКлиенте(Объект.Ссылка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;

	Если Не ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторСтроки) Или НоваяСтрока Тогда
		ТекущиеДанные.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды 
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
	
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура СкопироватьСсылкуВБуфер(Команда)

	СсылкаДляЗапуска = TK_ОбщегоНазначенияВызовСервера.ВнешняяСсылкаНаОпубликованныйДокумент(Объект.Ссылка);

	TK_ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(СсылкаДляЗапуска);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтобразитьВнешнююСсылкуНаОпубликованныйДокумент()

	ВнешняяСсылка = TK_ОбщегоНазначенияВызовСервера.ВнешняяСсылкаНаОпубликованныйДокумент(
		Объект.Ссылка);

	Элементы.ГруппаСсылкаНаДокумент.Видимость = ЗначениеЗаполнено(ВнешняяСсылка);
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьТекущийСтатусПубликацииДокумета()

	СтатусПубликации = TK_ОбщегоНазначенияВызовСервера.СтатусПубликацииДокумента(Объект.Ссылка);

	Если Не ЗначениеЗаполнено(СтатусПубликации) Тогда
		СтатусПубликации = Перечисления.TK_СтатусыПубликацииЗапросовЦен.НеОпубликован;
	КонецЕсли;
	Элементы.ГруппаОповещениеОбОбновленииДокумента.Видимость = СтатусПубликации
		= Перечисления.TK_СтатусыПубликацииЗапросовЦен.ТребуетсяОбновление;

КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоДоступнымОрганизациям()
	
	МассивОрганизаций = TK_ОбщегоНазначенияВызовСервера.ПолучитьСписокДоступныхОрганизаций();

	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОрганизаций)));

	НовыйПараметр = Новый ФиксированныйМассив(МассивПараметров);

	Элементы.Организация.ПараметрыВыбора = НовыйПараметр;
	
КонецПроцедуры

#КонецОбласти
